modm-ext/data.modm.io/docs/svd/header_stm32l422xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USB</name>
      <description>Universal Serial Bus Full Speed Device</description>
      <baseAddress>0x40006800</baseAddress>
      <interrupt>
        <name>USB</name>
        <description>USB event Interrupt</description>
        <value>67</value>
      </interrupt>
      <registers>
        <register>
          <name>EP0R</name>
          <description>USB Endpoint 0 register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP1R</name>
          <description>USB Endpoint 1 register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP2R</name>
          <description>USB Endpoint 2 register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP3R</name>
          <description>USB Endpoint 3 register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP4R</name>
          <description>USB Endpoint 4 register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP5R</name>
          <description>USB Endpoint 5 register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP6R</name>
          <description>USB Endpoint 6 register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>EP7R</name>
          <description>USB Endpoint 7 register</description>
          <addressOffset>0x1c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>CNTR</name>
          <description>Control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>ISTR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>FNR</name>
          <description>Frame number register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>DADDR</name>
          <description>Device address register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>BTABLE</name>
          <description>Buffer Table address register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>LPMCSR</name>
          <description>LPM Control and Status register</description>
          <addressOffset>0x54</addressOffset>
          <size>0x10</size>
        </register>
        <register>
          <name>BCDR</name>
          <description>Battery Charging detector register</description>
          <addressOffset>0x58</addressOffset>
          <size>0x10</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power Control</description>
      <baseAddress>0x40007000</baseAddress>
      <registers>
        <register>
          <name>CR1</name>
          <description>PWR power control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>LPMS</name>
              <description>Low-power mode selection field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable Back-up domain Protection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOS</name>
              <description>VOS[1:0] bits (Regulator voltage scaling output selection)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPR</name>
              <description>Regulator low-power mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>PWR power control register 2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVDE</name>
              <description>Power Voltage Detector Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PLS</name>
              <description>PVD level selection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PVDLEVEL_0</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PVDLEVEL_7</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PVME1</name>
              <description>PVM 1 Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVME3</name>
              <description>PVM 3 Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVME4</name>
              <description>PVM 4 Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USV</name>
              <description>VDD USB Supply Valid</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <description>PWR power control register 3</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>EWUP1</name>
              <description>Enable Wake-Up Pin 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP2</name>
              <description>Enable Wake-Up Pin 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP3</name>
              <description>Enable Wake-Up Pin 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP4</name>
              <description>Enable Wake-Up Pin 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EWUP5</name>
              <description>Enable Wake-Up Pin 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRS</name>
              <description>SRAM2 Retention in Stand-by mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SRAM2_RETENTION</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_SRAM2_RETENTION</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APC</name>
              <description>Apply pull-up and pull-down configuration</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENULP</name>
              <description>Enable ULP BORL, BORH and PVD for STOP2 and Standby modes</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIWUL</name>
              <description>Enable Internal Wake-up line</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <description>PWR power control register 4</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WP1</name>
              <description>Wake-Up Pin 1 polarity</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WP2</name>
              <description>Wake-Up Pin 2 polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WP3</name>
              <description>Wake-Up Pin 3 polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WP4</name>
              <description>Wake-Up Pin 4 polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WP5</name>
              <description>Wake-Up Pin 5 polarity</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT Battery charging Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT Battery charging Resistor Selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHARG_RESISTOR_5K</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHARGRESISTOR_1_5K</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_SMPS_ON</name>
              <description>Inform the internal regulator on external SMPS switch status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>PWR power status register 1</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WUF1</name>
              <description>Wake-up Flag 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF2</name>
              <description>Wake-up Flag 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF3</name>
              <description>Wake-up Flag 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF4</name>
              <description>Wake-up Flag 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUF5</name>
              <description>Wake-up Flag 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SBF</name>
              <description>Stand-By Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXT_SMPS_RDY</name>
              <description>Switching to external SMPS Ready Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUFI</name>
              <description>Wake-Up Flag Internal</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>PWR power status register 2</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>REGLPS</name>
              <description>Low-power Regulator Started</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REGLPF</name>
              <description>Low-power Regulator Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VOSF</name>
              <description>Voltage Scaling Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDO</name>
              <description>Power Voltage Detector Output</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVMO1</name>
              <description>Peripheral Voltage Monitoring Output 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVMO3</name>
              <description>Peripheral Voltage Monitoring Output 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVMO4</name>
              <description>Peripheral Voltage Monitoring Output 4</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <description>PWR power status reset register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>CWUF1</name>
              <description>Clear Wake-up Flag 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF2</name>
              <description>Clear Wake-up Flag 2</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF3</name>
              <description>Clear Wake-up Flag 3</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF4</name>
              <description>Clear Wake-up Flag 4</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CWUF5</name>
              <description>Clear Wake-up Flag 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSBF</name>
              <description>Clear Stand-By Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRA</name>
          <description>Pull_up control register of portA</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PA0</name>
              <description>Port PA0 Pull-Up set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA1</name>
              <description>Port PA1 Pull-Up set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA2</name>
              <description>Port PA2 Pull-Up set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA3</name>
              <description>Port PA3 Pull-Up set</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA4</name>
              <description>Port PA4 Pull-Up set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA5</name>
              <description>Port PA5 Pull-Up set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA6</name>
              <description>Port PA6 Pull-Up set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA7</name>
              <description>Port PA7 Pull-Up set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA8</name>
              <description>Port PA8 Pull-Up set</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA9</name>
              <description>Port PA9 Pull-Up set</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA10</name>
              <description>Port PA10 Pull-Up set</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA11</name>
              <description>Port PA11 Pull-Up set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA12</name>
              <description>Port PA12 Pull-Up set</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA13</name>
              <description>Port PA13 Pull-Up set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PA15</name>
              <description>Port PA15 Pull-Up set</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
